# SetImageControlHandle

## Description
Sets the image definition node handle for the specified Layout Manager image control.

```pascal
PROCEDURE SetImageControlHandle(
				dialogID    : LONGINT;
				componentID : LONGINT;
				hImage      : HANDLE);
```

```python
def vs.SetImageControlHandle(dialogID, componentID, hImage):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|componentID|LONGINT|   |
|hImage|HANDLE|   |

## Version
Availability: from VectorWorks12.0

## Category
* Dialogs - Modern